; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v8 - type_1 ?v5 - type_3)
 	      (pred_2 ?v2 - object ?v5 - type_3)
	      (pred_1 ?v8 - type_1 ?v4 - type_2)
	      (pred_4 ?v8 - type_1 ?v2 - object ?v4 - type_2))

   (:action op_3
       :parameters  (?v8 - type_1 ?v7 ?v6 - type_3)
       :precondition (and  (pred_3 ?v8 ?v7))
       :effect (and  (pred_3 ?v8 ?v6)
		     (not (pred_3 ?v8 ?v7))))

   (:action op_1
       :parameters (?v8 - type_1 ?v1 - object ?v3 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_2 ?v1 ?v3) (pred_3 ?v8 ?v3) (pred_1 ?v8 ?v4))
       :effect (and (pred_4 ?v8 ?v1 ?v4)
		    (not (pred_2 ?v1 ?v3)) 
		    (not (pred_1 ?v8 ?v4))))

   (:action op_2
       :parameters (?v8 - type_1 ?v1 - object ?v3 - type_3 ?v4 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v1 ?v4) (pred_3 ?v8 ?v3))
       :effect (and (pred_2 ?v1 ?v3)
		    (pred_1 ?v8 ?v4)
		    (not (pred_4 ?v8 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_01 - type_1
obj_06 obj_14 obj_10 obj_05 - type_2
obj_03 obj_11 obj_12 obj_09 - type_3
obj_07 obj_04 obj_13 obj_02 - object)
(:init
(pred_3 obj_08 obj_11)
(pred_1 obj_08 obj_06)
(pred_1 obj_08 obj_14)
(pred_3 obj_01 obj_09)
(pred_1 obj_01 obj_10)
(pred_1 obj_01 obj_05)
(pred_2 obj_07 obj_11)
(pred_2 obj_04 obj_09)
(pred_2 obj_13 obj_09)
(pred_2 obj_02 obj_09)
)
(:goal
(and
(pred_2 obj_07 obj_11)
(pred_2 obj_04 obj_12)
(pred_2 obj_13 obj_03)
(pred_2 obj_02 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_08 obj_12)))
)
)

; plan
1. (op_1 obj_01 obj_04 obj_09 obj_05)
   deleted: (pred_2 obj_04 obj_09) (pred_1 obj_01 obj_05)
   added: (pred_4 obj_01 obj_04 obj_05)
   goals met: 1 of 4
2. (op_1 obj_01 obj_13 obj_09 obj_10)
   deleted: (pred_2 obj_13 obj_09) (pred_1 obj_01 obj_10)
   added: (pred_4 obj_01 obj_13 obj_10)
   goals met: 1 of 4
3. (op_3 obj_08 obj_11 obj_09)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_09)
   goals met: 1 of 4
4. (op_3 obj_01 obj_09 obj_12)
   deleted: (pred_3 obj_01 obj_09)
   added: (pred_3 obj_01 obj_12)
   goals met: 1 of 4
5. (op_1 obj_08 obj_02 obj_09 obj_14)
   deleted: (pred_2 obj_02 obj_09) (pred_1 obj_08 obj_14)
   added: (pred_4 obj_08 obj_02 obj_14)
   goals met: 1 of 4
6. (op_2 obj_01 obj_04 obj_12 obj_05)
   deleted: (pred_4 obj_01 obj_04 obj_05)
   added: (pred_2 obj_04 obj_12) (pred_1 obj_01 obj_05)
   goals met: 2 of 4
7. (op_3 obj_08 obj_09 obj_11)
   deleted: (pred_3 obj_08 obj_09)
   added: (pred_3 obj_08 obj_11)
   goals met: 2 of 4
8. (op_3 obj_01 obj_12 obj_03)
   deleted: (pred_3 obj_01 obj_12)
   added: (pred_3 obj_01 obj_03)
   goals met: 2 of 4
9. (op_2 obj_08 obj_02 obj_11 obj_14)
   deleted: (pred_4 obj_08 obj_02 obj_14)
   added: (pred_2 obj_02 obj_11) (pred_1 obj_08 obj_14)
   goals met: 3 of 4
10. (op_2 obj_01 obj_13 obj_03 obj_10)
   deleted: (pred_4 obj_01 obj_13 obj_10)
   added: (pred_2 obj_13 obj_03) (pred_1 obj_01 obj_10)
   goals met: 4 of 4
